In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

# Pierwsza ramka danych

In [4]:
ramka1 = pd.DataFrame({"A":np.round(np.random.uniform(0, 1, 5), 2),
                      "B" : ["k", None, "k", "m", "k"],
                      "C" : [False, True, True, False, False]})
ramka1

      A     B      C
0  0.54     k  False
1  0.27  None   True
2  0.90     k   True
3  0.56     m  False
4  0.23     k  False

# Wymiary ramki

In [5]:
ramka1.shape

(5, 3)

In [6]:
len(ramka1)

5

In [7]:
ramka1.size

15

# Wczytamy gotowe ramki danych

In [8]:
flights = sns.load_dataset("flights")

In [9]:
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [10]:
tips = sns.load_dataset("tips")

# Metody do zapoznania się z nową ramką

In [11]:
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [12]:
flights.head(10)

   year      month  passengers
0  1949    January         112
1  1949   February         118
2  1949      March         132
3  1949      April         129
4  1949        May         121
5  1949       June         135
6  1949       July         148
7  1949     August         148
8  1949  September         136
9  1949    October         119

In [13]:
flights.head(3)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132

In [14]:
flights.tail()

     year      month  passengers
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

In [15]:
flights.tail(3)

     year     month  passengers
141  1960   October         461
142  1960  November         390
143  1960  December         432

In [16]:
flights.dtypes # typ Series

year             int64
month         category
passengers       int64
dtype: object

In [19]:
flights.dtypes[0]

dtype('int64')

In [17]:
flights.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 3 columns):
year          144 non-null int64
month         144 non-null category
passengers    144 non-null int64
dtypes: category(1), int64(2)
memory usage: 2.9 KB

In [18]:
ramka1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
A    5 non-null float64
B    4 non-null object
C    5 non-null bool
dtypes: bool(1), float64(1), object(1)
memory usage: 213.0+ bytes

# Wybieranie kolumn

In [21]:
type(ramka1["A"])

pandas.core.series.Series

In [20]:
# sposób niezawodny, nawet jeśli nazwa kolumny ma spację czy jej nazwa jest wbudowanym atrybutem, jak shape, columns, index, etc.
# ew. jak chcemy podmieniać nazwy kolumn w kodzie, to te rzucają się bardziej w oczy (bo sa czerwone)
ramka1["A"] # typ Series

0    0.54
1    0.27
2    0.90
3    0.56
4    0.23
Name: A, dtype: float64

In [23]:
ramka1.shape

(5, 3)

In [22]:
ramka1.A # sposób zawodny, za to wygodny

0    0.54
1    0.27
2    0.90
3    0.56
4    0.23
Name: A, dtype: float64

In [24]:
ramka1.get("A") # raczej nieużywany

0    0.54
1    0.27
2    0.90
3    0.56
4    0.23
Name: A, dtype: float64

In [107]:
ramka1[["A", "B"]]

      A    B
0  0.54    k
1  0.27  NaN
2  0.90    k
3  0.56    m
4  0.23    k

In [108]:
ramka1[["B","A"]]

     B     A
0    k  0.54
1  NaN  0.27
2    k  0.90
3    m  0.56
4    k  0.23

# Pod spodem jest wektor Numpy

In [110]:
#sprowadzenie kolumny do zwykłego wektora Numpy
ramka1.A.values

array([0.54, 0.27, 0.9 , 0.56, 0.23])

# Typ kategoryczny

In [25]:
# przykład z życia:
flights.month

0        January
1       February
2          March
3          April
4            May
         ...
139       August
140    September
141      October
142     November
143     December
Name: month, Length: 144, dtype: category
Categories (12, object): [January, February, March, April, ..., September, October, November, December]

In [26]:
flights.dtypes

year             int64
month         category
passengers       int64
dtype: object

In [28]:
ramka1.dtypes

A    float64
B     object
C       bool
dtype: object

In [31]:
ramka1.B = ramka1.B.astype("category")
ramka1

      A    B      C
0  0.54    k  False
1  0.27  NaN   True
2  0.90    k   True
3  0.56    m  False
4  0.23    k  False

In [32]:
ramka1.dtypes

A     float64
B    category
C        bool
dtype: object

In [33]:
inna_kategoryczna = pd.Series(pd.Categorical(["a", "b", "c", "a"]))
inna_kategoryczna

0    a
1    b
2    c
3    a
dtype: category
Categories (3, object): [a, b, c]

In [35]:
# jakościowa nominalna
inna_kategoryczna = pd.Series(
    pd.Categorical(["a", "b", "c", "a"], 
                   categories=["b", "a", "d","c"]))
inna_kategoryczna

0    a
1    b
2    c
3    a
dtype: category
Categories (4, object): [b, a, d, c]

In [36]:
# wprowadzamy porządek
# jakościowa porządkowa
inna_kategoryczna = pd.Series(
    pd.Categorical(["a", "b", "c", "a"], 
                   categories=["b", "a", "d","c"],
                   ordered=True))
inna_kategoryczna

0    a
1    b
2    c
3    a
dtype: category
Categories (4, object): [b < a < d < c]

In [37]:
# zajrzyjmy pod maskę
inna_kategoryczna.cat.codes

0    1
1    0
2    3
3    1
dtype: int8

In [38]:
inna_kategoryczna.cat.categories

Index(['b', 'a', 'd', 'c'], dtype='object')

In [39]:
inna_kategoryczna

0    a
1    b
2    c
3    a
dtype: category
Categories (4, object): [b < a < d < c]

In [40]:
inna_kategoryczna[0] = "d"
inna_kategoryczna

0    d
1    b
2    c
3    a
dtype: category
Categories (4, object): [b < a < d < c]

In [41]:
inna_kategoryczna[0] = "e"
inna_kategoryczna

ValueError: Cannot setitem on a Categorical with a new category, set the categories first

In [43]:
# dodanie kategorii
inna_kategoryczna = inna_kategoryczna.cat.add_categories("e")
inna_kategoryczna

0    d
1    b
2    c
3    a
dtype: category
Categories (5, object): [b < a < d < c < e]

In [45]:
# zmiana porządku
inna_kategoryczna = inna_kategoryczna.cat.reorder_categories(["a", "b", "c", "d", "e"])
inna_kategoryczna

0    d
1    b
2    c
3    a
dtype: category
Categories (5, object): [a < b < c < d < e]

In [47]:
# zmiana interpretacji
inna_kategoryczna.cat.categories = ["musza","lekka", "kogucia", "średni", "ciężka"]
inna_kategoryczna

0     średni
1      lekka
2    kogucia
3      musza
dtype: category
Categories (5, object): [musza < lekka < kogucia < średni < ciężka]

In [48]:
ramka1.A

0    0.54
1    0.27
2    0.90
3    0.56
4    0.23
Name: A, dtype: float64

In [49]:
pd.cut(ramka1.A, np.r_[0, 0.25, 0.4, 0.7, 1])

0     (0.4, 0.7]
1    (0.25, 0.4]
2     (0.7, 1.0]
3     (0.4, 0.7]
4    (0.0, 0.25]
Name: A, dtype: category
Categories (4, interval[float64]): [(0.0, 0.25] < (0.25, 0.4] < (0.4, 0.7] < (0.7, 1.0]]

In [51]:
wagi_bokserskie = pd.cut(ramka1.A, np.r_[0, 0.25, 0.4, 0.7, 1],
      right=False,
      labels=["musza", "średnia", "ciężka", "superciężka"])
wagi_bokserskie

0         ciężka
1        średnia
2    superciężka
3         ciężka
4          musza
Name: A, dtype: category
Categories (4, object): [musza < średnia < ciężka < superciężka]

In [53]:
wagi_bokserskie.sort_values()

4          musza
1        średnia
0         ciężka
3         ciężka
2    superciężka
Name: A, dtype: category
Categories (4, object): [musza < średnia < ciężka < superciężka]

# Indeksy

In [54]:
ramka1

      A    B      C
0  0.54    k  False
1  0.27  NaN   True
2  0.90    k   True
3  0.56    m  False
4  0.23    k  False

In [55]:
ramka1.index

RangeIndex(start=0, stop=5, step=1)

In [56]:
ramka1.columns

Index(['A', 'B', 'C'], dtype='object')

In [57]:
ramka2 = ramka1.copy()

In [58]:
ramka2.index = ["a", "e", "d", "c", "b"]

In [59]:
ramka2

      A    B      C
a  0.54    k  False
e  0.27  NaN   True
d  0.90    k   True
c  0.56    m  False
b  0.23    k  False

In [60]:
ramka2.index

Index(['a', 'e', 'd', 'c', 'b'], dtype='object')

In [62]:
ramka2 =ramka1.set_index(np.linspace(0, 1, 5))
ramka2

         A    B      C
0.00  0.54    k  False
0.25  0.27  NaN   True
0.50  0.90    k   True
0.75  0.56    m  False
1.00  0.23    k  False

In [63]:
ramka2.index

Float64Index([0.0, 0.25, 0.5, 0.75, 1.0], dtype='float64')

In [64]:
ramka2.columns = ["a","b","c"]
ramka2

         a    b      c
0.00  0.54    k  False
0.25  0.27  NaN   True
0.50  0.90    k   True
0.75  0.56    m  False
1.00  0.23    k  False

In [65]:
ramka2.columns = [1,2,3]
ramka2

         1    2      3
0.00  0.54    k  False
0.25  0.27  NaN   True
0.50  0.90    k   True
0.75  0.56    m  False
1.00  0.23    k  False

In [66]:
ramka2.index.name = "Wiersze"
ramka2.columns.name = "Kolumny"
ramka2

Kolumny     1    2      3
Wiersze
0.00     0.54    k  False
0.25     0.27  NaN   True
0.50     0.90    k   True
0.75     0.56    m  False
1.00     0.23    k  False

In [67]:
ramka2.reset_index()

Kolumny  Wiersze     1    2      3
0           0.00  0.54    k  False
1           0.25  0.27  NaN   True
2           0.50  0.90    k   True
3           0.75  0.56    m  False
4           1.00  0.23    k  False

In [68]:
ramka2.reset_index(drop=True)

Kolumny     1    2      3
0        0.54    k  False
1        0.27  NaN   True
2        0.90    k   True
3        0.56    m  False
4        0.23    k  False

## MultiIndeksy (MultiIndex, indeks hierarchiczny)

In [69]:
ramka2 = pd.DataFrame({"A" : np.round(np.random.uniform(0, 1, 6), 2)})
ramka2

      A
0  0.66
1  0.07
2  0.39
3  0.69
4  0.18
5  0.74

In [71]:
ramka2.index = pd.MultiIndex(levels=[["x", "y", "z"], [1,2,3,4]],
                            codes = [[0,0,0,1,1,2], [0,1,3,0,1,2]],
                            names=["i1", "i2"])
ramka2

          A
i1 i2
x  1   0.66
   2   0.07
   4   0.39
y  1   0.69
   2   0.18
z  3   0.74

# Wybór wierszy (obserwacji), tzw. indeksowanie

In [73]:
b = pd.Series(np.round(np.random.uniform(0,1,10), 2))
i = np.r_[0:10]
np.random.shuffle(i)
b.index = i
b

2    0.41
9    0.75
5    0.33
6    0.52
8    0.76
4    0.14
7    0.42
3    0.94
0    0.72
1    0.59
dtype: float64

In [74]:
c = b.copy()
c.index = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"]
c

a    0.41
b    0.75
c    0.33
d    0.52
e    0.76
f    0.14
g    0.42
h    0.94
i    0.72
j    0.59
dtype: float64

## Wybieramy slicem

In [76]:
b[0:2] # wybrały się po pozycji (który z kolei)

2    0.41
9    0.75
dtype: float64

In [77]:
c[0:2]

a    0.41
b    0.75
dtype: float64

## Wybieramy warunkiem logicznym

In [78]:
b[b>0.5]

9    0.75
6    0.52
8    0.76
3    0.94
0    0.72
1    0.59
dtype: float64

In [79]:
c[c>0.5]

b    0.75
d    0.52
e    0.76
h    0.94
i    0.72
j    0.59
dtype: float64

## Podajemy pojedynczą liczbę całkowitą

In [80]:
b[0] # jeśli da się użyć jako indeksu, to szuka po indeksie (tym Pandasowym)

0.72

In [82]:
c[0] # jeśli nie da się użyć jako indeksu, to zwraca po pozycji

0.41

In [83]:
b[[0,1]] # po indeksie

0    0.72
1    0.59
dtype: float64

In [84]:
c[[0,1]] # po pozycji

a    0.41
b    0.75
dtype: float64

In [85]:
b.iloc[0] # po pozycji, iloc ZAWSZE po pozycji

0.41

In [86]:
b.iloc[[0,1]]

2    0.41
9    0.75
dtype: float64

In [87]:
b.iloc[0:3]

2    0.41
9    0.75
5    0.33
dtype: float64

In [88]:
c.iloc[0] # będzie to samo dla wszystkich przykładów

0.41

In [89]:
b.loc[0] # zawsze po indeksie Pandasowym

0.72

In [91]:
b.loc[5:7] # namierza pozycję indeksu 5, indeksu 7, i zwraca wszystko pomiędzy

5    0.33
6    0.52
8    0.76
4    0.14
7    0.42
dtype: float64

In [94]:
c

a    0.41
b    0.75
c    0.33
d    0.52
e    0.76
f    0.14
g    0.42
h    0.94
i    0.72
j    0.59
dtype: float64

In [92]:
c.loc[0] # nie ma indeksu 0 w c

TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [0] of <class 'int'>

In [93]:
c.loc["e"]

0.76

In [95]:
c.loc["e":"h"]

e    0.76
f    0.14
g    0.42
h    0.94
dtype: float64

# Wstawianie kolumn/wierszy

In [96]:
ramka1

      A    B      C
0  0.54    k  False
1  0.27  NaN   True
2  0.90    k   True
3  0.56    m  False
4  0.23    k  False

In [97]:
# dodajemy kolumnę
ramka1["D"] = np.exp(ramka1.A)+1000
ramka1

      A    B      C            D
0  0.54    k  False  1001.716007
1  0.27  NaN   True  1001.309964
2  0.90    k   True  1002.459603
3  0.56    m  False  1001.750673
4  0.23    k  False  1001.258600

In [102]:
ramka1.drop("D", axis=1, inplace=True)

In [103]:
ramka1

      A    B      C
0  0.54    k  False
1  0.27  NaN   True
2  0.90    k   True
3  0.56    m  False
4  0.23    k  False

In [104]:
# dodawanie wiersza
ramka1.loc[8] = [11, "m", True]

In [105]:
ramka1

       A    B      C
0   0.54    k  False
1   0.27  NaN   True
2   0.90    k   True
3   0.56    m  False
4   0.23    k  False
8  11.00    m   True

In [106]:
ramka1.drop(8,inplace=True)
ramka1

      A    B      C
0  0.54    k  False
1  0.27  NaN   True
2  0.90    k   True
3  0.56    m  False
4  0.23    k  False

# Funkcje statystyczne, przetwarzanie ramek

In [112]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [113]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [114]:
tips.describe() # count to liczba nie-nulli, np. nie None i nie NaN

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [116]:
tips.describe(include="all")

        total_bill         tip   sex smoker  day    time        size
count   244.000000  244.000000   244    244  244     244  244.000000
unique         NaN         NaN     2      2    4       2         NaN
top            NaN         NaN  Male     No  Sat  Dinner         NaN
freq           NaN         NaN   157    151   87     176         NaN
mean     19.785943    2.998279   NaN    NaN  NaN     NaN    2.569672
std       8.902412    1.383638   NaN    NaN  NaN     NaN    0.951100
min       3.070000    1.000000   NaN    NaN  NaN     NaN    1.000000
25%      13.347500    2.000000   NaN    NaN  NaN     NaN    2.000000
50%      17.795000    2.900000   NaN    NaN  NaN     NaN    2.000000
75%      24.127500    3.562500   NaN    NaN  NaN     NaN    3.000000
max      50.810000   10.000000   NaN    NaN  NaN     NaN    6.000000

In [117]:
tips.mean()

total_bill    19.785943
tip            2.998279
size           2.569672
dtype: float64

In [118]:
tips.std()

total_bill    8.902412
tip           1.383638
size          0.951100
dtype: float64

In [119]:
tips.sex.describe()

count      244
unique       2
top       Male
freq       157
Name: sex, dtype: object

# Tabela przestawna (pivot table)

In [120]:
pd.pivot_table(tips[["smoker", "total_bill", "tip"]],
              index="smoker") # domyślnie aggfunc='mean'

             tip  total_bill
smoker
Yes     3.008710   20.756344
No      2.991854   19.188278

In [121]:
pd.pivot_table(tips[["smoker", "total_bill", "tip"]],
              columns="smoker")

smoker            Yes         No
tip          3.008710   2.991854
total_bill  20.756344  19.188278

In [122]:
pd.pivot_table(tips[["smoker", "total_bill", "tip"]],
              columns="smoker", aggfunc="sum")

smoker          Yes       No
tip          279.81   451.77
total_bill  1930.34  2897.43

In [123]:
pd.pivot_table(tips[["smoker", "total_bill", "tip"]],
              columns="smoker", aggfunc="min")

smoker       Yes    No
tip         1.00  1.00
total_bill  3.07  7.25

In [124]:
pd.pivot_table(tips[["smoker", "total_bill", "tip"]],
              columns="smoker", aggfunc="count") # zlicza not-null, może być różnie dla różnych kolumn

smoker      Yes   No
tip          93  151
total_bill   93  151

In [125]:
pd.pivot_table(tips[["smoker", "total_bill", "tip"]],
              columns="smoker", aggfunc="size") # zlicza ile wierszy jako całości wpada do odpowiedniej kategorii

smoker
Yes     93
No     151
dtype: int64

In [127]:
pd.pivot_table(tips[["smoker", "sex", "day", "time", "total_bill", "tip"]],
              columns=["smoker", "day"],
               index=["time", "sex"]
              )

                 tip                                                       \
smoker           Yes                                   No
day             Thur    Fri       Sat       Sun      Thur   Fri       Sat
time   sex
Lunch  Male    3.058  1.900       NaN       NaN  2.941500   NaN       NaN
       Female  2.990  2.660       NaN       NaN  2.437083  3.00       NaN
Dinner Male      NaN  3.246  2.879259  3.521333       NaN  2.50  3.256563
       Female    NaN  2.700  2.868667  3.500000  3.000000  3.25  2.724615

                        total_bill                                   \
smoker                         Yes
day                 Sun       Thur        Fri        Sat        Sun
time   sex
Lunch  Male         NaN  19.171000  11.386667        NaN        NaN
       Female       NaN  19.218571  13.260000        NaN        NaN
Dinner Male    3.115349        NaN  25.892000  21.837778  26.141333
       Female  3.329286        NaN  12.200000  20.266667  16.540000


smoker                No
day                 Thur     Fri        Sat        Sun
time   sex
Lunch  Male    18.486500     NaN        NaN        NaN
       Female  15.899167  15.980        NaN        NaN
Dinner Male          NaN  17.475  19.929063  20.403256
       Female  18.780000  22.750  19.003846  20.824286

In [128]:
pd.pivot_table(tips[["smoker", "sex", "day", "time", "total_bill", "tip"]],
              columns=["smoker", "day"],
               index=["time", "sex"],
               margins=True, 
               margins_name='All'
              )

                 tip                                                         \
smoker           Yes                                   No
day             Thur    Fri       Sat       Sun      Thur     Fri       Sat
time   sex
Lunch  Male    3.058  1.900       NaN       NaN  2.941500     NaN       NaN
       Female  2.990  2.660       NaN       NaN  2.437083  3.0000       NaN
Dinner Male      NaN  3.246  2.879259  3.521333       NaN  2.5000  3.256563
       Female    NaN  2.700  2.868667  3.500000  3.000000  3.2500  2.724615
All            3.030  2.714  2.875476  3.516842  2.673778  2.8125  3.102889

                                  total_bill                                   \
smoker                        All        Yes
day                 Sun                 Thur        Fri        Sat        Sun
time   sex
Lunch  Male         NaN  2.882121  19.171000  11.386667        NaN        NaN
       Female       NaN  2.582857  19.218571  13.260000        NaN        NaN
Dinner Male    3.115349  3.144839        NaN  25.892000  21.837778  26.141333
       Female  3.329286  3.002115        NaN  12.200000  20.266667  16.540000
All            3.167895  2.998279  19.190588  16.813333  21.276667  24.120000


smoker                No                                      All
day                 Thur     Fri        Sat        Sun
time   sex
Lunch  Male    18.486500     NaN        NaN        NaN  18.048485
       Female  15.899167  15.980        NaN        NaN  16.339143
Dinner Male          NaN  17.475  19.929063  20.403256  21.461452
       Female  18.780000  22.750  19.003846  20.824286  19.213077
All            17.113111  18.420  19.661778  20.506667  19.785943

In [129]:
pd.pivot_table(tips[["smoker", "sex", "day", "time", "total_bill"]],
              columns=["smoker"],
               index=["sex"],
               margins=True, 
               margins_name='All'
              )

       total_bill
smoker        Yes         No        All
sex
Male    22.284500  19.791237  20.744076
Female  17.977879  18.105185  18.056897
All     20.756344  19.188278  19.785943

# Group by

In [131]:
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [132]:
flights.groupby("year")

In [133]:
list(flights.groupby("year"))

[(1949,     year      month  passengers
  0   1949    January         112
  1   1949   February         118
  2   1949      March         132
  3   1949      April         129
  4   1949        May         121
  5   1949       June         135
  6   1949       July         148
  7   1949     August         148
  8   1949  September         136
  9   1949    October         119
  10  1949   November         104
  11  1949   December         118), (1950,     year      month  passengers
  12  1950    January         115
  13  1950   February         126
  14  1950      March         141
  15  1950      April         135
  16  1950        May         125
  17  1950       June         149
  18  1950       July         170
  19  1950     August         170
  20  1950  September         158
  21  1950    October         133
  22  1950   November         114
  23  1950   December         140), (1951,     year      month  passengers
  24  1951    January         145
  25  1951   February         150
  26  1951      March         178
  27  1951      April         163
  28  1951        May         172
  29  1951       June         178
  30  1951       July         199
  31  1951     August         199
  32  1951  September         184
  33  1951    October         162
  34  1951   November         146
  35  1951   December         166), (1952,     year      month  passengers
  36  1952    January         171
  37  1952   February         180
  38  1952      March         193
  39  1952      April         181
  40  1952        May         183
  41  1952       June         218
  42  1952       July         230
  43  1952     August         242
  44  1952  September         209
  45  1952    October         191
  46  1952   November         172
  47  1952   December         194), (1953,     year      month  passengers
  48  1953    January         196
  49  1953   February         196
  50  1953      March         236
  51  1953      April         235
  52  1953        May         229
  53  1953       June         243
  54  1953       July         264
  55  1953     August         272
  56  1953  September         237
  57  1953    October         211
  58  1953   November         180
  59  1953   December         201), (1954,     year      month  passengers
  60  1954    January         204
  61  1954   February         188
  62  1954      March         235
  63  1954      April         227
  64  1954        May         234
  65  1954       June         264
  66  1954       July         302
  67  1954     August         293
  68  1954  September         259
  69  1954    October         229
  70  1954   November         203
  71  1954   December         229), (1955,     year      month  passengers
  72  1955    January         242
  73  1955   February         233
  74  1955      March         267
  75  1955      April         269
  76  1955        May         270
  77  1955       June         315
  78  1955       July         364
  79  1955     August         347
  80  1955  September         312
  81  1955    October         274
  82  1955   November         237
  83  1955   December         278), (1956,     year      month  passengers
  84  1956    January         284
  85  1956   February         277
  86  1956      March         317
  87  1956      April         313
  88  1956        May         318
  89  1956       June         374
  90  1956       July         413
  91  1956     August         405
  92  1956  September         355
  93  1956    October         306
  94  1956   November         271
  95  1956   December         306), (1957,      year      month  passengers
  96   1957    January         315
  97   1957   February         301
  98   1957      March         356
  99   1957      April         348
  100  1957        May         355
  101  1957       June         422
  102  1957       July         465
  103  1957     August         467
  104  1957  September         404
  105  1957    October         347
  106  1957   November         305
  107  1957   December         336), (1958,      year      month  passengers
  108  1958    January         340
  109  1958   February         318
  110  1958      March         362
  111  1958      April         348
  112  1958        May         363
  113  1958       June         435
  114  1958       July         491
  115  1958     August         505
  116  1958  September         404
  117  1958    October         359
  118  1958   November         310
  119  1958   December         337), (1959,      year      month  passengers
  120  1959    January         360
  121  1959   February         342
  122  1959      March         406
  123  1959      April         396
  124  1959        May         420
  125  1959       June         472
  126  1959       July         548
  127  1959     August         559
  128  1959  September         463
  129  1959    October         407
  130  1959   November         362
  131  1959   December         405), (1960,      year      month  passengers
  132  1960    January         417
  133  1960   February         391
  134  1960      March         419
  135  1960      April         461
  136  1960        May         472
  137  1960       June         535
  138  1960       July         622
  139  1960     August         606
  140  1960  September         508
  141  1960    October         461
  142  1960   November         390
  143  1960   December         432)]

In [134]:
for (year, df) in flights.groupby("year"):
    print(f"year = {year}")
    print(df.head(3))

year = 1949
   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
year = 1950
    year     month  passengers
12  1950   January         115
13  1950  February         126
14  1950     March         141
year = 1951
    year     month  passengers
24  1951   January         145
25  1951  February         150
26  1951     March         178
year = 1952
    year     month  passengers
36  1952   January         171
37  1952  February         180
38  1952     March         193
year = 1953
    year     month  passengers
48  1953   January         196
49  1953  February         196
50  1953     March         236
year = 1954
    year     month  passengers
60  1954   January         204
61  1954  February         188
62  1954     March         235
year = 1955
    year     month  passengers
72  1955   January         242
73  1955  February         233
74  1955     March         267
year = 1956
    year     month  passengers
84  1956   January         284
85  1956  February         277
86  1956     March         317
year = 1957
    year     month  passengers
96  1957   January         315
97  1957  February         301
98  1957     March         356
year = 1958
     year     month  passengers
108  1958   January         340
109  1958  February         318
110  1958     March         362
year = 1959
     year     month  passengers
120  1959   January         360
121  1959  February         342
122  1959     March         406
year = 1960
     year     month  passengers
132  1960   January         417
133  1960  February         391
134  1960     March         419

In [135]:
flights.groupby("year").mean()

      passengers
year
1949  126.666667
1950  139.666667
1951  170.166667
1952  197.000000
1953  225.000000
1954  238.916667
1955  284.000000
1956  328.250000
1957  368.416667
1958  381.000000
1959  428.333333
1960  476.166667

In [136]:
tips.groupby(["day", "smoker"]).median()

             total_bill    tip  size
day  smoker
Thur Yes         16.470  2.560     2
     No          15.950  2.180     2
Fri  Yes         13.420  2.500     2
     No          19.235  3.125     2
Sat  Yes         20.390  2.690     2
     No          17.820  2.750     2
Sun  Yes         23.100  3.500     2
     No          18.430  3.020     3

In [137]:
tips.groupby(["day", "smoker"])["total_bill"].median()

day   smoker
Thur  Yes       16.470
      No        15.950
Fri   Yes       13.420
      No        19.235
Sat   Yes       20.390
      No        17.820
Sun   Yes       23.100
      No        18.430
Name: total_bill, dtype: float64

In [139]:
tips.groupby(["day", "smoker"]).size() # zlicza wiersze jako całości

day   smoker
Thur  Yes       17
      No        45
Fri   Yes       15
      No         4
Sat   Yes       42
      No        45
Sun   Yes       19
      No        57
dtype: int64

In [140]:
tips.groupby(["day", "smoker"]).count()

             total_bill  tip  sex  time  size
day  smoker
Thur Yes             17   17   17    17    17
     No              45   45   45    45    45
Fri  Yes             15   15   15    15    15
     No               4    4    4     4     4
Sat  Yes             42   42   42    42    42
     No              45   45   45    45    45
Sun  Yes             19   19   19    19    19
     No              57   57   57    57    57

# Tabela kontyngencji

In [141]:
# jednowymiarowo (jedna kolumna brana pod uwagę)
tips.smoker.value_counts()

No     151
Yes     93
Name: smoker, dtype: int64

In [142]:
pd.crosstab(tips.smoker, tips.sex)

sex     Male  Female
smoker
Yes       60      33
No        97      54

In [143]:
pd.crosstab([tips.smoker, tips.time], [tips.sex, tips.day])

sex           Male             Female
day           Thur Fri Sat Sun   Thur Fri Sat Sun
smoker time
Yes    Lunch    10   3   0   0      7   3   0   0
       Dinner    0   5  27  15      0   4  15   4
No     Lunch    20   0   0   0     24   1   0   0
       Dinner    0   2  32  43      1   1  13  14

# Sortowanie

In [144]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [145]:
tips.sort_values("total_bill")

     total_bill    tip     sex smoker   day    time  size
67         3.07   1.00  Female    Yes   Sat  Dinner     1
92         5.75   1.00  Female    Yes   Fri  Dinner     2
111        7.25   1.00  Female     No   Sat  Dinner     1
172        7.25   5.15    Male    Yes   Sun  Dinner     2
149        7.51   2.00    Male     No  Thur   Lunch     2
..          ...    ...     ...    ...   ...     ...   ...
182       45.35   3.50    Male    Yes   Sun  Dinner     3
156       48.17   5.00    Male     No   Sun  Dinner     6
59        48.27   6.73    Male     No   Sat  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
170       50.81  10.00    Male    Yes   Sat  Dinner     3

[244 rows x 7 columns]

In [146]:
tips.sort_values("total_bill", ascending=False)

     total_bill    tip     sex smoker   day    time  size
170       50.81  10.00    Male    Yes   Sat  Dinner     3
212       48.33   9.00    Male     No   Sat  Dinner     4
59        48.27   6.73    Male     No   Sat  Dinner     4
156       48.17   5.00    Male     No   Sun  Dinner     6
182       45.35   3.50    Male    Yes   Sun  Dinner     3
..          ...    ...     ...    ...   ...     ...   ...
149        7.51   2.00    Male     No  Thur   Lunch     2
111        7.25   1.00  Female     No   Sat  Dinner     1
172        7.25   5.15    Male    Yes   Sun  Dinner     2
92         5.75   1.00  Female    Yes   Fri  Dinner     2
67         3.07   1.00  Female    Yes   Sat  Dinner     1

[244 rows x 7 columns]

In [147]:
tips.total_bill.sort_values(ascending=False)# sortowanie na kolumnie

170    50.81
212    48.33
59     48.27
156    48.17
182    45.35
       ...
149     7.51
172     7.25
111     7.25
92      5.75
67      3.07
Name: total_bill, Length: 244, dtype: float64

In [148]:
tips.sort_values(["size","total_bill"], ascending=False) # globalnie po size, a w ramach remisu w size to po total_bill

     total_bill   tip     sex smoker   day    time  size
156       48.17  5.00    Male     No   Sun  Dinner     6
141       34.30  6.70    Male     No  Thur   Lunch     6
125       29.80  4.20  Female     No  Thur   Lunch     6
143       27.05  5.00  Female     No  Thur   Lunch     6
142       41.19  5.00    Male     No  Thur   Lunch     5
..          ...   ...     ...    ...   ...     ...   ...
92         5.75  1.00  Female    Yes   Fri  Dinner     2
82        10.07  1.83  Female     No  Thur   Lunch     1
222        8.58  1.92    Male    Yes   Fri   Lunch     1
111        7.25  1.00  Female     No   Sat  Dinner     1
67         3.07  1.00  Female    Yes   Sat  Dinner     1

[244 rows x 7 columns]

In [149]:
tips.sort_values(["size","total_bill"], ascending=[False,True]) # globalnie po size, a w ramach remisu w size to po total_bill

     total_bill   tip     sex smoker   day    time  size
143       27.05  5.00  Female     No  Thur   Lunch     6
125       29.80  4.20  Female     No  Thur   Lunch     6
141       34.30  6.70    Male     No  Thur   Lunch     6
156       48.17  5.00    Male     No   Sun  Dinner     6
185       20.69  5.00    Male     No   Sun  Dinner     5
..          ...   ...     ...    ...   ...     ...   ...
184       40.55  3.00    Male    Yes   Sun  Dinner     2
67         3.07  1.00  Female    Yes   Sat  Dinner     1
111        7.25  1.00  Female     No   Sat  Dinner     1
222        8.58  1.92    Male    Yes   Fri   Lunch     1
82        10.07  1.83  Female     No  Thur   Lunch     1

[244 rows x 7 columns]

# Bonus: zmienne czasowe

In [151]:
pd.date_range("2020-01-01", periods=3)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03'], dtype='datetime64[ns]', freq='D')

In [152]:
pd.Series(pd.date_range("2020-01-01", periods=3))

0   2020-01-01
1   2020-01-02
2   2020-01-03
dtype: datetime64[ns]

In [153]:
pd.Series(pd.date_range("2020-01-01", periods=3, freq="12H"))

0   2020-01-01 00:00:00
1   2020-01-01 12:00:00
2   2020-01-02 00:00:00
dtype: datetime64[ns]